OrgLatexTemplate.org
#+title: Org Latex Template
#+SETUPFILE: ./common-files/OrgLaTexSetup.org
#+INCLUDE: ./common-files/ProjectMacros.org
#+LATEX_HEADER: \lhead{\bfseries \documentheader }
#+OPTIONS: toc:nil
#+LANGUAGE: zh_cn

# Preamble
#+begin_export latex
\begin{center}
{\LARGE \projectname  \\}
\end{center}

\begin{center}
{\LARGE \projectname with SUBTITLE}
\end{center}

\mitlicense{2025}

\pagebreak[4]
\tableofcontents
\pagebreak[4]
\listoffigures
\pagebreak[4]
#+end_export

* Revision and Document Owner

# Document Revision
#+begin_export latex
\begin{table}[ht]
\begin{center}
\begin{tabularx}{0.8\textwidth} {
  | >{\raggedright\arraybackslash}X
  | >{\centering\arraybackslash}X
  | >{\raggedleft\arraybackslash}X | }
 \hline
 Document Name & \projectname & Comments \\
 \hline
 Revision  & \documentversion  &   \\
\hline
Status & <Draft> & \\
\hline
Date & \today & \\
\hline
\end{tabularx}
\caption{Document Revision}
\end{center}
\end{table}
#+end_export

# Review and Approval
Here insert the Reviewer/Approver contact information:
#+begin_export latex
\begin{table}[ht]
\begin{center}
\begin{tabularx}{1\textwidth} {
  | >{\raggedright\arraybackslash\hsize=1.3\hsize}X
  | >{\raggedright\arraybackslash\hsize=1.3\hsize}X
  | >{\raggedright\arraybackslash\hsize=.4\hsize}X | }
\hline
 Review(R)/Approve(A) & Name & Date \\\hline\hline
 Role A  & Mark   &   \\\hline
 Role B & Jessie  & \\\hline
 Role C & Lucy  & \\\hline
 Role D & Michael  & \\\hline
\end{tabularx}
\caption{Review and Approval}
\end{center}
\end{table}
#+end_export

#+latex: \pagebreak[4]

* Introduction
Give the project introduction here for {{{PROJECT_NAME}}}.

{{{PAGEBREAK}}}

* Document Reference
** Reference Category 1

@@latex:{\color{red}\textbf{NOTE:} include latest version link.}@@

** Reference Category 2
The referenced documentations are listed below:

#+begin_export latex
\begin{table}[h]
\begin{center}
\begin{tabularx}{\textwidth} {
  | >{\raggedright\arraybackslash\hsize=.5\hsize}X
  | >{\raggedright\arraybackslash\hsize=1.5\hsize}X | }
 \hline
 Love & Peace \\\hline\hline
 1 & Use your illusion \\\hline
 2 & Perfect Crime \\\hline
 3 & Bad Obsession \\\hline
 4 & Right Next Door to Hell \\\hline
 5 & Always on the Run \\\hline
 6 & Dust N'Bones \\\hline
 7 & Live and Let Die \\\hline
 8 & Attitude \\\hline
 9 & Double Talkin' Jive \\\hline
 10 & Don't Cry \\\hline
 11 & You Ain't the First \\\hline
 12 & It's Alright \\\hline
 13 & November Rain \\\hline
 14 & Bad Apples \\\hline
 15 & Wild Horses \\\hline
\end{tabularx}
\caption{Use Your Illusion List}
\end{center}
\end{table}
#+end_export

** Assumptions
Assume the reader's background, and list the necessary information need to know.

** Claims
@@latex:{\color{red}This section is intentionally left blank for furtherediting.}@@
Just to list the topics NOT included in this essay

** Traceabilities
List the traceabilities of the points noted within/without the essay.
@@latex:{\color{red}List a table for the traceability.}@@
{{{PAGEBREAK}}}

* System Description
** Overview
Give a summary of this essay.

** Each Detailed Section
