OrgLatexTemplate.tex
% Created 2025-03-17 Mon 17:15
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper, 11pt]{article}
                      \usepackage{lmodern}
\usepackage{fontspec, xunicode, xltxtra}
\usepackage{xeCJK}
\usepackage{tabularx}
\usepackage{longtable}
\usepackage{changelog}
\usepackage[table]{xcolor}
\usepackage{datetime2}
\usepackage{multirow}
\usepackage{adjustbox}
\usepackage[most]{tcolorbox}
\usepackage{times}
\usepackage{epsf}
\usepackage{epsfig}
\usepackage{amsmath, alltt, amssymb, xspace}
\usepackage{wrapfig}
\usepackage{fancyhdr}
\usepackage{url}
\usepackage{verbatim}
\usepackage{fancyvrb}
\usepackage{adjustbox}
\usepackage{listings}
\usepackage{color}
\usepackage{subfigure}
\usepackage{cite}
\usepackage{sidecap}
\usepackage{pifont}
\usepackage{mdframed}
\usepackage{textcomp}
\usepackage{enumitem}
\usepackage{ragged2e}
\usepackage[normalem]{ulem}
\definecolor{bblue}{HTML}{0645AD}
\usepackage[colorlinks]{hyperref}
\newcommand{\commonfolder}{./common-files}
\input{\commonfolder/copyright}
\topmargin      -0.50in  % distance to headers
\oddsidemargin  0.0in
\evensidemargin 0.0in
\textwidth      6.5in
\textheight     8.9in
\pagestyle{fancy}
\chead{}
\rhead{\small \thepage}
\lfoot{}
\cfoot{}
\rfoot{}
\newcommand{\projectname}{USE YOUR PROJECT NAME}
\newcommand{\documentheader}{Your Header, NOT Shoulder}
\newcommand{\documentversion}{0.0.1}
\lhead{\bfseries \documentheader }
\setmainfont[Ligatures=TeX]{Alegreya}
\setsansfont{Alegreya Sans}
\newcolumntype{d}{>{\hsize=2\hsize}X}
\newcolumntype{h}{>{\hsize=.5\hsize}X}
\author{Luo Jie}
\date{\today}
\title{Org Latex Template}
\hypersetup{
pdfauthor={Luo Jie},
pdftitle={Org Latex Template},
pdfkeywords={},
pdfsubject={},
pdfcreator={Emacs 30.1 (Org mode 9.7.19)},
pdflang={Zh_Cn},
colorlinks=true,
linkcolor=black}
\begin{document}

\begin{center}
{\LARGE \projectname  \\}
\end{center}

\begin{center}
{\LARGE \projectname with SUBTITLE}
\end{center}

\mitlicense{2025}

\pagebreak[4]
\tableofcontents
\pagebreak[4]
\listoffigures
\pagebreak[4]
\section{Revision and Document Owner}
\label{sec:orgc178992}

\begin{table}[ht]
\begin{center}
\begin{tabularx}{0.8\textwidth} {
  | >{\raggedright\arraybackslash}X
  | >{\centering\arraybackslash}X
  | >{\raggedleft\arraybackslash}X | }
 \hline
 Document Name & \projectname & Comments \\
 \hline
 Revision  & \documentversion  &   \\
\hline
Status & <Draft> & \\
\hline
Date & \today & \\
\hline
\end{tabularx}
\caption{Document Revision}
\end{center}
\end{table}

Here insert the Reviewer/Approver contact information:
\begin{table}[ht]
\begin{center}
\begin{tabularx}{1\textwidth} {
  | >{\raggedright\arraybackslash\hsize=1.3\hsize}X
  | >{\raggedright\arraybackslash\hsize=1.3\hsize}X
  | >{\raggedright\arraybackslash\hsize=.4\hsize}X | }
\hline
 Review(R)/Approve(A) & Name & Date \\\hline\hline
 Role A  & Mark   &   \\\hline
 Role B & Jessie  & \\\hline
 Role C & Lucy  & \\\hline
 Role D & Michael  & \\\hline
\end{tabularx}
\caption{Review and Approval}
\end{center}
\end{table}

\pagebreak[4]
\section{Introduction}
\label{sec:org80b2350}
Give the project introduction here for "INPUT YOUR PROJECT NAME".

\pagebreak[4]
\section{Document Reference}
\label{sec:org5ab300d}
\subsection{Reference Category 1}
\label{sec:org9dfd4ad}

{\color{red}\textbf{NOTE:} include latest version link.}
\subsection{Reference Category 2}
\label{sec:org81278b7}
The referenced documentations are listed below:

\begin{table}[h]
\begin{center}
\begin{tabularx}{\textwidth} {
  | >{\raggedright\arraybackslash\hsize=.5\hsize}X
  | >{\raggedright\arraybackslash\hsize=1.5\hsize}X | }
 \hline
 Love & Peace \\\hline\hline
 1 & Use your illusion \\\hline
 2 & Perfect Crime \\\hline
 3 & Bad Obsession \\\hline
 4 & Right Next Door to Hell \\\hline
 5 & Always on the Run \\\hline
 6 & Dust N'Bones \\\hline
 7 & Live and Let Die \\\hline
 8 & Attitude \\\hline
 9 & Double Talkin' Jive \\\hline
 10 & Don't Cry \\\hline
 11 & You Ain't the First \\\hline
 12 & It's Alright \\\hline
 13 & November Rain \\\hline
 14 & Bad Apples \\\hline
 15 & Wild Horses \\\hline
\end{tabularx}
\caption{Use Your Illusion List}
\end{center}
\end{table}
\subsection{Assumptions}
\label{sec:orga6fd5b0}
Assume the reader's background, and list the necessary information need to know.
\subsection{Claims}
\label{sec:orgdb1efe3}
{\color{red}This section is intentionally left blank for furtherediting.}
Just to list the topics NOT included in this essay
\subsection{Traceabilities}
\label{sec:org9d76bb7}
List the traceabilities of the points noted within/without the essay.
{\color{red}List a table for the traceability.}
\pagebreak[4]
\section{System Description}
\label{sec:org43b08d7}
\subsection{Overview}
\label{sec:orgddd1aee}
Give a summary of this essay.
\subsection{Each Detailed Section}
\label{sec:org863b6da}
\end{document}
